{
    "roadSigns": [
      {
        "id": "1.1",
        "name": "Головна дорога",
        "description": "Знак вказує, що дорога є головною в порівнянні з перехрещуваними або з'єднаними з нею дорогами."
      },
      {
        "id": "1.2",
        "name": "Небезпечний поворот ліворуч",
        "description": "Знак попереджає про заокруглення дороги радіусом менше 500м поза населеними пунктами і менше 150 м — у населених пунктах або про заокруглення з обмеженою оглядовістю."
      },
      {
        "id": "1.3.1",
        "name": "Декілька поворотів",
        "description": "Знак позначає ділянку дороги з двома і більше розташованими один за одним небезпечними поворотами, з першим поворотом праворуч."
      },
      {
        "id": "1.3.2",
        "name": " Декілька поворотів",
        "description": "Знак позначає ділянку дороги з двома і більше розташованими один за одним небезпечними поворотами, з першим поворотом ліворуч."
      },
      {
        "id": "1.4.1",
        "name": " Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух праворуч), позначеної знаком 1.1 'Небезпечний поворот праворуч', напрямок об’їзду перешкоди на дорозі і напрямок об’їзду центра перехрестя з круговим рухом."
      },
      {
        "id": "1.4.2",
        "name": " Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух ліворуч), позначеної знаком 1.2 'Небезпечний поворот ліворуч', напрямок об’їзду перешкоди на дорозі."
      },
      {
        "id": "1.4.3",
        "name": " Напрямок повороту",
        "description": "Знак показує напрямок руху на Т-подібних перехрестях (рух праворуч або ліворуч), розгалуженнях доріг або об’їзду ділянки дороги, що ремонтується."
      },
      {
        "id": "1.4.4 ",
        "name": "Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух праворуч), позначеної знаком 1.1 "
      },
      {
        "id": "1.4.5 ",
        "name": "Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух ліворуч), позначеної знаком 1.2"
      },
      {
        "id": "1.4.6",
        "name": "Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух праворуч), позначеної знаком 1.1. На поворотах з обмеженою оглядовістю, якщо при наближенні до повороту важко визначити напрямок повороту, перевагу потрібно надавати знаку 1.4.4"
      },
      {
        "id": "1.4.7 ",
        "name": "Напрямок повороту",
        "description": "Знак показує напрямок повороту дороги (рух ліворуч), позначеної знаком 1.2.На поворотах з обмеженою оглядовістю, якщо при наближенні до повороту важко визначити напрямок повороту, перевагу потрібно надавати знаку 1.4.5 "
      },
      {
        "id": "1.5.1  ",
        "name": "Звуження дороги",
        "description": "Знак попереджає про звуження дороги з обох сторін. "
      },
      {
        "id": "1.5.2",
        "name": "Звуження дороги",
        "description": "Знак попереджає про звуження дороги з правого боку."
      },
      {
        "id": "1.5.3",
        "name": "Звуження дороги",
        "description": "Знак попереджає про звуження дороги з лівого боку."
      },
      {
        "id": "1.6",
        "name": "Крутий підйом",
        "description": "Знак попереджає про наближення до підйому."
      },
      {
        "id": "1.7",
        "name": "Крутий спуск",
        "description": "Знак попереджає про наближення до спуску."
      },
      {
        "id": "1.8",
        "name": "Виїзд на набережну або берег",
        "description": "Знак попереджає про виїзд на берег водойми, у тому числі на поромну переправу."
      },
      {
        "id": "1.9",
        "name": "Тунель",
        "description": "Знак попереджає про наближення до тунелю, позначеного знаком 5.74: споруди, що не має штучного освітлення, оглядовість в’їзного порталу якої обмежена і на під’їздах до якої звужена проїзна частина."
      },
      {
        "id": "1.10",
        "name": "Нерівна дорога",
        "description": "Знак встановлюється перед ділянкою дороги, що має нерівності проїзної частини — хвилястості, напливи, спучування."
      },

      {
        "id": "1.11",
        "name": "Пагорб",
        "description": "Знак встановлюється перед ділянкою дороги з буграми, напливами чи не плавним стикуванням конструкцій мостів. Знак також може застосовуватися перед штучно створюваними буграми у місцях, де необхідно примусово обмежити швидкість руху транспортних засобів (небезпечні виїзди з прилеглих територій, місця з інтенсивним рухом дітей через дорогу тощо)."
      },
      {
        "id": "1.12",
        "name": "Вибоїна",
        "description": "Знак встановлюється за наявності на ділянках доріг вибоїн, просідань дорожнього покриття, розміри яких перевищують допустимі значення згідно з ДСТУ 3587."
      },
      {
        "id": "1.13",
        "name": "Слизька дорога",
        "description": "Знак попереджає, що попереду ділянка дороги з підвищеною слизькістю проїзної частини."
      },
      {
        "id": "1.14",
        "name": "Викидання кам’яних матеріалів",
        "description": "Попереджає, що попереду ділянка дороги, на якій можливе викидання гравію, щебеню тощо з-під коліс транспортних засобів."
      },
      {
        "id": "1.15",
        "name": "Небезпечне узбіччя",
        "description": "Попереджає про підвищене, занижене, зруйноване узбіччя. Або узбіччя, на якому виконуються ремонтні роботи."
      },
      {
        "id": "1.16",
        "name": "Падіння каміння",
        "description": "Попереджає, що попереду ділянка дороги, на якій можуть бути падіння каміння, обвали, зсуви."
      },
      {
        "id": "1.17",
        "name": "Боковий вітер",
        "description": "Встановлюється перед ділянками доріг, що проходять через гірські перевали, високі насипи, мости, шляхопроводи, вздовж урвищ та річок тощо, на яких можливий сильний боковий вітер або його раптові пориви."
      },
      {
        "id": "1.18",
        "name": "Низьколітаючі літаки",
        "description": "Встановлюється перед ділянкою дороги, яка проходить поблизу аеродрому або над якою літаки чи вертольоти пролітають на невеликій висоті."
      },
      {
        "id": "1.19",
        "name": "Перехрещення з рухом по колу",
        "description": "Попереджає про наближення до перехрестя з круговим рухом."
      },
      {
        "id": "1.20",
        "name": "Перехрещення з трамвайною колією",
        "description": "Встановлюється в місці перетинання дороги з трамвайною колією на перехресті з обмеженою оглядовістю чи поза ним."
      },




      
      {
        "id": "1.21",
        "name": "Перехрещення рівнозначних доріг",
        "description": "Даний дорожній знак попереджає про наближення до перехрестя рівнозначних доріг."
      },  
      {
        "id": "1.22",
        "name": "Перехрещення з другорядною дорогою",
        "description": "Цей дорожній знак вказує на перехрестя з другорядною дорогою і вказує на те, що ми знаходимося на головній дорозі."
      },  


      {
        "id": "1.23.1",
        "name": "Прилягання другорядної дороги",
        "description": "Знак попереджає про прилягання другорядної дороги з правого боку."
      },  
      {
        "id": "1.23.2",
        "name": "Прилягання другорядної дороги",
        "description": "Знак попереджає про прилягання другорядної дороги з лівого боку."
      },  
      {
        "id": "1.23.3",
        "name": "Прилягання другорядної дороги",
        "description": "Знак попереджає про прилягання другорядної дороги з правого і лівого боку."
      },  
      {
        "id": "1.23.4",
        "name": "Прилягання другорядної дороги",
        "description": "Знак попереджає про прилягання другорядної дороги з лівого і правого боку."
      },  
      {
        "id": "1.24",
        "name": "Світлофорне регулювання",
        "description": "Знак установлюється перед перехрестям, пішохідним переходом або ділянкою дороги, рух на якій регулюється світлофором."
      },  
      {
        "id": "1.25",
        "name": "Розвідний міст",
        "description": "Знак попереджає про наближення до розвідного моста."
      },  
      {
        "id": "1.26",
        "name": "Двосторонній рух",
        "description": "Початок ділянки дороги (проїзної частини) зі зустрічним рухом після одностороннього."
      },  
      {
        "id": "1.27",
        "name": "Залізничний переїзд із шлагбаумом",
        "description": "Цей дорожній знак попереджає про те, що попереду переправа обладнана шлагбаумом."
      },  
      {
        "id": "1.28",
        "name": "Залізничний переїзд без шлагбаума",
        "description": "Цей дорожній знак попереджає про те, що попереду переправа  не обладнана шлагбаумом."
      },  
      {
        "id": "1.29",
        "name": "Одноколійна залізниця",
        "description": "Позначення не обладнаного шлаг­баумом переїзду через залізницю з однією колією."
      },  
      {
        "id": "1.31.1",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.31.2",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.31.3",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.31.4",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.31.5",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.31.6",
        "name": "Наближення до залізничного переїзду",
        "description": "Додаткове попередження про наближення до залізничного переїзду поза населеними пунктами. Що менше смуг, то ближче переїзд."
      },  
      {
        "id": "1.32",
        "name": "Пішохідний перехід",
        "description": "Наближення до нерегульованого пішохідного переходу, позначеного відповідними дорожніми знаками або дорожньою розміткою."
      },  
      {
        "id": "1.33",
        "name": "Діти",
        "description": "Ділянка дороги, на якій можлива поява дітей з території дитячого закладу (дошкільний заклад, школа, оздоровчий табір тощо), що прилягає безпосередньо до дороги."
      },  
      {
        "id": "1.34",
        "name": "Виїзд велосипедистів",
        "description": "Ділянка дороги, на якій можлива поява велосипедистів, або місце перехрещення з велосипедною доріжкою поза перехрестям."
      },  
      {
        "id": "1.35",
        "name": "Перегін худоби",
        "description": "Ділянка дороги, на якій можлива поява худоби."
      },  
      {
        "id": "1.36",
        "name": "Дикі тварини",
        "description": "Ділянка дороги, на якій можлива поява диких тварин."
      },  
      {
        "id": "1.37",
        "name": "Дорожні роботи",
        "description": "Ділянка дороги, на якій виконуються дорожні роботи."
      },  
      {
        "id": "1.38",
        "name": "Затори в дорожньому русі",
        "description": "Ділянка дороги, де звуження проїзної частини спричиняє затори в дорожньому русі внаслідок виконання дорожніх робіт чи з інших причин."
      },   
      {
        "id": "1.39",
        "name": "Аварійно небезпечна ділянка",
        "description": "Ділянка дороги у місці, де геометричні параметри проїзної частини, радіуси вертикальних і горизонтальних кривих тощо не відповідають вимогам будівельних норм."
      },  
      {
        "id": "1.40",
        "name": "Зміна покриття",
        "description": "Ділянка дороги, на якій змінюється вид покриття."
      },  
      {
        "id": "1.40",
        "name": "Зміна покриття",
        "description": "Ділянка дороги, на якій змінюється вид покриття."
      },  
      {
        "id": "1.41",
        "name": "Зміна покриття",
        "description": "Місце (Ділянка) концентрації дорожньо-транспортних пригод"
      },   
      {
        "id": "2.1",
        "name": "Дати дорогу",
        "description": "Водій повинен дати дорогу транспортним засобам, що під’їжджають до нерегульованого перехрестя по головній дорозі, а за наявності таблички 7.8 – транспортним засобам, що рухаються по головній дорозі."
      },

      {
        "id": "2.2",
        "name": "Проїзд без зупинки заборонено",
        "description": "Забороняється проїзд без зупинки перед розміткою 1.12 (стоп-лінія), а якщо вона відсутня – перед знаком. Необхідно дати дорогу транспортним засобам, що рухаються дорогою, яка перетинається, а за наявності таблички 7.8 – транспортним засобам, що рухаються головною дорогою, а також праворуч рівнозначною дорогою."
      },
      {
        "id": "2.3",
        "name": "Головна дорога",
        "description": "Надається право першочергового проїзду нерегульованих перехресть."
      }
















    ]
  }